; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-3-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p1-8 - location
	p2-3 - location
	p2-8 - location
	p2-9 - location
	p3-5 - location
	p3-6 - location
	p4-1 - location
	p4-11 - location
	p5-8 - location
	p5-13 - location
	p6-1 - location
	p6-3 - location
	p6-12 - location
	p6-14 - location
	p8-4 - location
	p8-7 - location
	p9-8 - location
	p9-10 - location
	p10-2 - location
	p10-5 - location
	p10-12 - location
	p12-0 - location
	p12-4 - location
	p13-8 - location
	p13-9 - location
	p14-5 - location
	p14-10 - location
	p14-11 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s1)
	(at driver3 s10)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s13)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s12)
	(at package2 s3)
	(at package3 s2)
	(at package4 s10)
	(at package5 s6)
	(at package6 s10)
	(at package7 s5)
	(at package8 s4)
	(at package9 s9)
	(at package10 s11)
	(at package11 s0)
	(at package12 s12)
	(at package13 s0)
	(at package14 s8)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 24)
	(= (time-to-walk p1-8 s1) 24)
	(= (time-to-walk s8 p1-8) 98)
	(= (time-to-walk p1-8 s8) 98)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 97)
	(= (time-to-walk p2-3 s2) 97)
	(= (time-to-walk s3 p2-3) 1)
	(= (time-to-walk p2-3 s3) 1)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 69)
	(= (time-to-walk p2-8 s2) 69)
	(= (time-to-walk s8 p2-8) 29)
	(= (time-to-walk p2-8 s8) 29)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 93)
	(= (time-to-walk p2-9 s2) 93)
	(= (time-to-walk s9 p2-9) 5)
	(= (time-to-walk p2-9 s9) 5)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 29)
	(= (time-to-walk p3-5 s3) 29)
	(= (time-to-walk s5 p3-5) 60)
	(= (time-to-walk p3-5 s5) 60)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 37)
	(= (time-to-walk p3-6 s3) 37)
	(= (time-to-walk s6 p3-6) 70)
	(= (time-to-walk p3-6 s6) 70)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 66)
	(= (time-to-walk p4-1 s4) 66)
	(= (time-to-walk s1 p4-1) 4)
	(= (time-to-walk p4-1 s1) 4)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(= (time-to-walk s4 p4-11) 3)
	(= (time-to-walk p4-11 s4) 3)
	(= (time-to-walk s11 p4-11) 80)
	(= (time-to-walk p4-11 s11) 80)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 82)
	(= (time-to-walk p5-8 s5) 82)
	(= (time-to-walk s8 p5-8) 63)
	(= (time-to-walk p5-8 s8) 63)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(= (time-to-walk s5 p5-13) 58)
	(= (time-to-walk p5-13 s5) 58)
	(= (time-to-walk s13 p5-13) 85)
	(= (time-to-walk p5-13 s13) 85)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 6)
	(= (time-to-walk p6-1 s6) 6)
	(= (time-to-walk s1 p6-1) 18)
	(= (time-to-walk p6-1 s1) 18)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(= (time-to-walk s6 p6-12) 70)
	(= (time-to-walk p6-12 s6) 70)
	(= (time-to-walk s12 p6-12) 75)
	(= (time-to-walk p6-12 s12) 75)
	(path s6 p6-14)
	(path p6-14 s6)
	(path s14 p6-14)
	(path p6-14 s14)
	(= (time-to-walk s6 p6-14) 74)
	(= (time-to-walk p6-14 s6) 74)
	(= (time-to-walk s14 p6-14) 74)
	(= (time-to-walk p6-14 s14) 74)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(= (time-to-walk s8 p8-4) 58)
	(= (time-to-walk p8-4 s8) 58)
	(= (time-to-walk s4 p8-4) 63)
	(= (time-to-walk p8-4 s4) 63)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 31)
	(= (time-to-walk p8-7 s8) 31)
	(= (time-to-walk s7 p8-7) 13)
	(= (time-to-walk p8-7 s7) 13)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(= (time-to-walk s9 p9-8) 40)
	(= (time-to-walk p9-8 s9) 40)
	(= (time-to-walk s8 p9-8) 55)
	(= (time-to-walk p9-8 s8) 55)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(= (time-to-walk s9 p9-10) 10)
	(= (time-to-walk p9-10 s9) 10)
	(= (time-to-walk s10 p9-10) 36)
	(= (time-to-walk p9-10 s10) 36)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(= (time-to-walk s10 p10-2) 55)
	(= (time-to-walk p10-2 s10) 55)
	(= (time-to-walk s2 p10-2) 79)
	(= (time-to-walk p10-2 s2) 79)
	(path s10 p10-5)
	(path p10-5 s10)
	(path s5 p10-5)
	(path p10-5 s5)
	(= (time-to-walk s10 p10-5) 64)
	(= (time-to-walk p10-5 s10) 64)
	(= (time-to-walk s5 p10-5) 48)
	(= (time-to-walk p10-5 s5) 48)
	(path s10 p10-12)
	(path p10-12 s10)
	(path s12 p10-12)
	(path p10-12 s12)
	(= (time-to-walk s10 p10-12) 83)
	(= (time-to-walk p10-12 s10) 83)
	(= (time-to-walk s12 p10-12) 93)
	(= (time-to-walk p10-12 s12) 93)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(= (time-to-walk s12 p12-0) 7)
	(= (time-to-walk p12-0 s12) 7)
	(= (time-to-walk s0 p12-0) 20)
	(= (time-to-walk p12-0 s0) 20)
	(path s12 p12-4)
	(path p12-4 s12)
	(path s4 p12-4)
	(path p12-4 s4)
	(= (time-to-walk s12 p12-4) 63)
	(= (time-to-walk p12-4 s12) 63)
	(= (time-to-walk s4 p12-4) 73)
	(= (time-to-walk p12-4 s4) 73)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(= (time-to-walk s13 p13-8) 23)
	(= (time-to-walk p13-8 s13) 23)
	(= (time-to-walk s8 p13-8) 65)
	(= (time-to-walk p13-8 s8) 65)
	(path s13 p13-9)
	(path p13-9 s13)
	(path s9 p13-9)
	(path p13-9 s9)
	(= (time-to-walk s13 p13-9) 52)
	(= (time-to-walk p13-9 s13) 52)
	(= (time-to-walk s9 p13-9) 5)
	(= (time-to-walk p13-9 s9) 5)
	(path s14 p14-5)
	(path p14-5 s14)
	(path s5 p14-5)
	(path p14-5 s5)
	(= (time-to-walk s14 p14-5) 28)
	(= (time-to-walk p14-5 s14) 28)
	(= (time-to-walk s5 p14-5) 9)
	(= (time-to-walk p14-5 s5) 9)
	(path s14 p14-10)
	(path p14-10 s14)
	(path s10 p14-10)
	(path p14-10 s10)
	(= (time-to-walk s14 p14-10) 90)
	(= (time-to-walk p14-10 s14) 90)
	(= (time-to-walk s10 p14-10) 33)
	(= (time-to-walk p14-10 s10) 33)
	(path s14 p14-11)
	(path p14-11 s14)
	(path s11 p14-11)
	(path p14-11 s11)
	(= (time-to-walk s14 p14-11) 26)
	(= (time-to-walk p14-11 s14) 26)
	(= (time-to-walk s11 p14-11) 59)
	(= (time-to-walk p14-11 s11) 59)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 8)
	(= (time-to-drive s8 s0) 8)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 100)
	(= (time-to-drive s11 s0) 100)
	(link s0 s13)
	(link s13 s0)
	(= (time-to-drive s0 s13) 33)
	(= (time-to-drive s13 s0) 33)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 66)
	(= (time-to-drive s0 s1) 66)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 62)
	(= (time-to-drive s10 s1) 62)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 63)
	(= (time-to-drive s12 s1) 63)
	(link s1 s14)
	(link s14 s1)
	(= (time-to-drive s1 s14) 78)
	(= (time-to-drive s14 s1) 78)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 1)
	(= (time-to-drive s11 s2) 1)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 17)
	(= (time-to-drive s10 s3) 17)
	(link s3 s14)
	(link s14 s3)
	(= (time-to-drive s3 s14) 87)
	(= (time-to-drive s14 s3) 87)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 37)
	(= (time-to-drive s3 s4) 37)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 72)
	(= (time-to-drive s5 s4) 72)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 65)
	(= (time-to-drive s8 s4) 65)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 100)
	(= (time-to-drive s11 s4) 100)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 19)
	(= (time-to-drive s6 s5) 19)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 48)
	(= (time-to-drive s7 s5) 48)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 93)
	(= (time-to-drive s8 s5) 93)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 26)
	(= (time-to-drive s12 s5) 26)
	(link s5 s13)
	(link s13 s5)
	(= (time-to-drive s5 s13) 68)
	(= (time-to-drive s13 s5) 68)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 55)
	(= (time-to-drive s2 s6) 55)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 98)
	(= (time-to-drive s7 s6) 98)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 91)
	(= (time-to-drive s11 s6) 91)
	(link s7 s13)
	(link s13 s7)
	(= (time-to-drive s7 s13) 20)
	(= (time-to-drive s13 s7) 20)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 50)
	(= (time-to-drive s9 s8) 50)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 95)
	(= (time-to-drive s2 s9) 95)
	(link s9 s12)
	(link s12 s9)
	(= (time-to-drive s9 s12) 47)
	(= (time-to-drive s12 s9) 47)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 59)
	(= (time-to-drive s0 s10) 59)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 85)
	(= (time-to-drive s8 s10) 85)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 80)
	(= (time-to-drive s9 s10) 80)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 85)
	(= (time-to-drive s7 s11) 85)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 43)
	(= (time-to-drive s10 s11) 43)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 87)
	(= (time-to-drive s2 s12) 87)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 84)
	(= (time-to-drive s4 s12) 84)
	(link s12 s7)
	(link s7 s12)
	(= (time-to-drive s12 s7) 75)
	(= (time-to-drive s7 s12) 75)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 52)
	(= (time-to-drive s11 s12) 52)
	(link s13 s3)
	(link s3 s13)
	(= (time-to-drive s13 s3) 46)
	(= (time-to-drive s3 s13) 46)
	(link s13 s4)
	(link s4 s13)
	(= (time-to-drive s13 s4) 38)
	(= (time-to-drive s4 s13) 38)
	(link s13 s9)
	(link s9 s13)
	(= (time-to-drive s13 s9) 30)
	(= (time-to-drive s9 s13) 30)
	(link s13 s14)
	(link s14 s13)
	(= (time-to-drive s13 s14) 47)
	(= (time-to-drive s14 s13) 47)
	(link s14 s2)
	(link s2 s14)
	(= (time-to-drive s14 s2) 54)
	(= (time-to-drive s2 s14) 54)
	(link s14 s4)
	(link s4 s14)
	(= (time-to-drive s14 s4) 17)
	(= (time-to-drive s4 s14) 17)
	(link s14 s5)
	(link s5 s14)
	(= (time-to-drive s14 s5) 83)
	(= (time-to-drive s5 s14) 83)
	(link s14 s8)
	(link s8 s14)
	(= (time-to-drive s14 s8) 25)
	(= (time-to-drive s8 s14) 25)
	(link s14 s11)
	(link s11 s14)
	(= (time-to-drive s14 s11) 82)
	(= (time-to-drive s11 s14) 82)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s11)
	(at truck1 s5)
	(at package1 s12)
	(at package2 s14)
	(at package3 s4)
	(at package4 s13)
	(at package5 s3)
	(at package6 s4)
	(at package7 s0)
	(at package8 s6)
	(at package9 s4)
	(at package10 s9)
	(at package11 s6)
	(at package12 s10)
	(at package13 s12)
	(at package14 s8)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 17
2. (load-truck package8 truck3 s4)
   deleted: (at package8 s4)
   added: (in package8 truck3)
   goals met: 3 of 17
3. (drive-truck truck3 s4 s14 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s14)
   changed: (driven) from 0 to 17
   goals met: 3 of 17
4. (drive-truck truck3 s14 s1 driver1)
   deleted: (at truck3 s14)
   added: (at truck3 s1)
   changed: (driven) from 17 to 95
   goals met: 3 of 17
5. (drive-truck truck3 s1 s10 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s10)
   changed: (driven) from 95 to 157
   goals met: 3 of 17
6. (load-truck package4 truck3 s10)
   deleted: (at package4 s10)
   added: (in package4 truck3)
   goals met: 3 of 17
7. (drive-truck truck3 s10 s0 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s0)
   changed: (driven) from 157 to 216
   goals met: 3 of 17
8. (load-truck package11 truck3 s0)
   deleted: (at package11 s0)
   added: (in package11 truck3)
   goals met: 3 of 17
9. (load-truck package13 truck3 s0)
   deleted: (at package13 s0)
   added: (in package13 truck3)
   goals met: 3 of 17
10. (drive-truck truck3 s0 s10 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s10)
   changed: (driven) from 216 to 275
   goals met: 3 of 17
11. (load-truck package6 truck3 s10)
   deleted: (at package6 s10)
   added: (in package6 truck3)
   goals met: 3 of 17
12. (drive-truck truck3 s10 s11 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s11)
   changed: (driven) from 275 to 318
   goals met: 3 of 17
13. (load-truck package10 truck3 s11)
   deleted: (at package10 s11)
   added: (in package10 truck3)
   goals met: 3 of 17
14. (walk driver2 s1 p1-8)
   deleted: (at driver2 s1)
   added: (at driver2 p1-8)
   changed: (walked) from 0 to 24
   goals met: 3 of 17
15. (walk driver2 p1-8 s8)
   deleted: (at driver2 p1-8)
   added: (at driver2 s8)
   changed: (walked) from 24 to 122
   goals met: 3 of 17
16. (walk driver2 s8 p2-8)
   deleted: (at driver2 s8)
   added: (at driver2 p2-8)
   changed: (walked) from 122 to 151
   goals met: 3 of 17
17. (walk driver2 p2-8 s2)
   deleted: (at driver2 p2-8)
   added: (at driver2 s2)
   changed: (walked) from 151 to 220
   goals met: 4 of 17
18. (drive-truck truck3 s11 s12 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (driven) from 318 to 370
   goals met: 4 of 17
19. (unload-truck package13 truck3 s12)
   deleted: (in package13 truck3)
   added: (at package13 s12)
   goals met: 5 of 17
20. (load-truck package12 truck3 s12)
   deleted: (at package12 s12)
   added: (in package12 truck3)
   goals met: 5 of 17
21. (drive-truck truck3 s12 s11 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s11)
   changed: (driven) from 370 to 422
   goals met: 5 of 17
22. (drive-truck truck3 s11 s0 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s0)
   changed: (driven) from 422 to 522
   goals met: 5 of 17
23. (drive-truck truck3 s0 s13 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s13)
   changed: (driven) from 522 to 555
   goals met: 5 of 17
24. (unload-truck package4 truck3 s13)
   deleted: (in package4 truck3)
   added: (at package4 s13)
   goals met: 6 of 17
25. (walk driver3 s10 p14-10)
   deleted: (at driver3 s10)
   added: (at driver3 p14-10)
   changed: (walked) from 220 to 253
   goals met: 6 of 17
26. (walk driver3 p14-10 s14)
   deleted: (at driver3 p14-10)
   added: (at driver3 s14)
   changed: (walked) from 253 to 343
   goals met: 6 of 17
27. (walk driver3 s14 p14-11)
   deleted: (at driver3 s14)
   added: (at driver3 p14-11)
   changed: (walked) from 343 to 369
   goals met: 6 of 17
28. (walk driver3 p14-11 s11)
   deleted: (at driver3 p14-11)
   added: (at driver3 s11)
   changed: (walked) from 369 to 428
   goals met: 7 of 17
29. (drive-truck truck3 s13 s9 driver1)
   deleted: (at truck3 s13)
   added: (at truck3 s9)
   changed: (driven) from 555 to 585
   goals met: 7 of 17
30. (unload-truck package10 truck3 s9)
   deleted: (in package10 truck3)
   added: (at package10 s9)
   goals met: 8 of 17
31. (load-truck package9 truck3 s9)
   deleted: (at package9 s9)
   added: (in package9 truck3)
   goals met: 8 of 17
32. (drive-truck truck3 s9 s13 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s13)
   changed: (driven) from 585 to 615
   goals met: 8 of 17
33. (drive-truck truck3 s13 s4 driver1)
   deleted: (at truck3 s13)
   added: (at truck3 s4)
   changed: (driven) from 615 to 653
   goals met: 8 of 17
34. (unload-truck package6 truck3 s4)
   deleted: (in package6 truck3)
   added: (at package6 s4)
   goals met: 9 of 17
35. (unload-truck package9 truck3 s4)
   deleted: (in package9 truck3)
   added: (at package9 s4)
   goals met: 10 of 17
36. (drive-truck truck3 s4 s3 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 653 to 690
   goals met: 10 of 17
37. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   goals met: 10 of 17
38. (drive-truck truck3 s3 s14 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s14)
   changed: (driven) from 690 to 777
   goals met: 10 of 17
39. (unload-truck package2 truck3 s14)
   deleted: (in package2 truck3)
   added: (at package2 s14)
   goals met: 11 of 17
40. (drive-truck truck3 s14 s5 driver1)
   deleted: (at truck3 s14)
   added: (at truck3 s5)
   changed: (driven) from 777 to 860
   goals met: 11 of 17
41. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   goals met: 11 of 17
42. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 860 to 932
   goals met: 11 of 17
43. (drive-truck truck3 s4 s11 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s11)
   changed: (driven) from 932 to 1032
   goals met: 11 of 17
44. (drive-truck truck3 s11 s0 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s0)
   changed: (driven) from 1032 to 1132
   goals met: 11 of 17
45. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   goals met: 12 of 17
46. (drive-truck truck3 s0 s11 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s11)
   changed: (driven) from 1132 to 1232
   goals met: 12 of 17
47. (drive-truck truck3 s11 s2 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s2)
   changed: (driven) from 1232 to 1233
   goals met: 12 of 17
48. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   goals met: 12 of 17
49. (drive-truck truck3 s2 s9 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 1233 to 1328
   goals met: 12 of 17
50. (drive-truck truck3 s9 s10 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (driven) from 1328 to 1408
   goals met: 12 of 17
51. (unload-truck package12 truck3 s10)
   deleted: (in package12 truck3)
   added: (at package12 s10)
   goals met: 13 of 17
52. (drive-truck truck3 s10 s3 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s3)
   changed: (driven) from 1408 to 1425
   goals met: 13 of 17
53. (drive-truck truck3 s3 s4 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 1425 to 1462
   goals met: 13 of 17
54. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   goals met: 14 of 17
55. (drive-truck truck3 s4 s11 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s11)
   changed: (driven) from 1462 to 1562
   goals met: 14 of 17
56. (drive-truck truck3 s11 s6 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s6)
   changed: (driven) from 1562 to 1653
   goals met: 14 of 17
57. (unload-truck package11 truck3 s6)
   deleted: (in package11 truck3)
   added: (at package11 s6)
   goals met: 15 of 17
58. (unload-truck package8 truck3 s6)
   deleted: (in package8 truck3)
   added: (at package8 s6)
   goals met: 16 of 17
59. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   goals met: 16 of 17
60. (drive-truck truck3 s6 s5 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (driven) from 1653 to 1672
   goals met: 16 of 17
61. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 1672 to 1744
   goals met: 16 of 17
62. (drive-truck truck3 s4 s3 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 1744 to 1781
   goals met: 16 of 17
63. (unload-truck package5 truck3 s3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 17 of 17
